UnknownDK/ES10-Drowning/PSoCSampler/SamplingCircuit.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "DmaI2S_three.h"
#include "I2S_DMA_three_dma.h"
#include "cs_aliases.h"
#include "cs.h"
#include "I2Sthree.h"
#include "I2Sthree_PVT.h"
#include "MOSI_1_aliases.h"
#include "MOSI_1.h"
#include "MISO_1_aliases.h"
#include "MISO_1.h"
#include "SCLK_1_aliases.h"
#include "SCLK_1.h"
#include "SPIM.h"
#include "SPIM_PVT.h"
#include "Clock_3.h"
#include "I2S_DMA_one_dma.h"
#include "I2Sone.h"
#include "I2Sone_PVT.h"
#include "DmaI2S_one.h"
#include "I2S_Clock.h"
#include "DmaI2S_two.h"
#include "I2S_DMA_two_dma.h"
#include "I2Stwo.h"
#include "I2Stwo_PVT.h"
#include "I2Sfour.h"
#include "I2Sfour_PVT.h"
#include "I2S_DMA_four_dma.h"
#include "DmaI2S_four.h"
#include "I2Ssix.h"
#include "I2Ssix_PVT.h"
#include "I2S_DMA_six_dma.h"
#include "DmaI2S_six.h"
#include "I2Sfive.h"
#include "I2Sfive_PVT.h"
#include "I2S_DMA_five_dma.h"
#include "DmaI2S_five.h"
#include "I2Sseven.h"
#include "I2Sseven_PVT.h"
#include "I2S_DMA_seven_dma.h"
#include "DmaI2S_seven.h"
#include "DMA_TX_dma.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

